Examinator/src/Enums/ТипыТестовыхВопросов/ТипыТестовыхВопросов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыТестовыхВопросов</name>
  <enumValues>
    <name>МногиеИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногих</name>
  </enumValues>
  <enumValues>
    <name>ОдинИзМногихНаКартинке</name>
  </enumValues>
  <enumValues>
    <name>Последовательность</name>
  </enumValues>
  <enumValues>
    <name>ВводСКлавиатуры</name>
  </enumValues>
  <enumValues>
    <name>Соответствие</name>
  </enumValues>
</mdclass:Enum>

Examinator/src/Enums/ТипыТестовыхВопросов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	ЭлектронноеОбучениеСлужебный.ИсключитьЗначенияПеречисленияИзСпискаВыбора(Параметры, ДанныеВыбора, "ТипыТестовыхВопросов", СтандартнаяОбработка);	

КонецПроцедуры

#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции

// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

Функция ТипВопросаВСтроку(ТипВопроса) Экспорт
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногих Тогда
		Возврат "SINGLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ОдинИзМногихНаКартинке Тогда
		Возврат "SINGLE";
	КонецЕсли;	
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.МногиеИзМногих Тогда
		Возврат "MULTIPLE";
	КонецЕсли;
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.Последовательность Тогда
		Возврат "SEQUENCE";
	КонецЕсли;	
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.ВводСКлавиатуры Тогда
		Возврат "INPUT";
	КонецЕсли;		
	
	Если ТипВопроса = Перечисления.ТипыТестовыхВопросов.Соответствие Тогда
		Возврат "MAP";
	КонецЕсли;		
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#КонецЕсли
